[
  {
    "title": "Huffman Encoding",
    "date": "Aug 2018",
    "description": "An Android application provides easy encoding of text with the Huffman algorithm, a method of minimally encoding a character set. New dictionaries can be added and shared between users, making the encoded text unreadable to all those who haven't been given the original dictionary, and are of the smallest possible file size in addition.",
    "image": "https://i.imgur.com/pgGwJtX.png",
    "link": "https://github.com/SkylerRankin/Huffman"
  },
  {
    "title": "Pixel Game",
    "date": "May 2018",
    "description": "In Development: A 2D side scrolling action game based on a science fiction story line. This game is built with the libGDX framework, utilizing OpenGL for graphics and my own custom built Entity-Component System to handle scalable architecture. This should be playable and complete within a few months!",
    "image": "https://i.imgur.com/c7FCHJZ.gif",
    "link": "Not on Github yet"
  },
  {
    "title": "QR Message Encoder",
    "date": "Nov 2017",
    "description": "A JavaFX application takes text, encodes it into binary, and draws that binary into a JPEG resembling a common QR code. You can also decode an image to reveal the text that was originally hidden.",
    "image": "https://i.imgur.com/7wFeTUb.gif",
    "link": "https://github.com/SkylerRankin/QRMessage"
  },
  {
    "title": "Sola - A Minimalist 2D Framework",
    "date": "Oct 2017",
    "description": "A javascript framework for 2D canvas games, animations, and graphics. Implements essential backend functionality of a working game while providing a simple interface for building on top. 100% editable for customization.",
    "image": "http://i.imgur.com/BZbK1ga.png",
    "link": "https://github.com/SkylerRankin/Sola"
  },
  {
    "title": "agar.io",
    "date": "Sep 2017",
    "description": "A humble attempt to imitate the popular agar.io browser game. NodeJS, Express, and web sockets were used to handle the multi-player functionality.",
    "image": "https://i.imgur.com/bbUPRJh.gif",
    "link": "https://github.com/SkylerRankin/agario"
  },
  {
    "title": "Contra",
    "date": "Sep 2017",
    "description": "An imitation of the first section of Konami's Contra. The spritesheets are formed from the actual graphics, but the game itself was programmed entirely from scratch with no framework beyond a Java Swing panel.",
    "image": "https://i.imgur.com/taTB8Eb.gif",
    "link": "https://github.com/SkylerRankin/Contra"
  },
  {
    "title": "Text Editor",
    "date": "Aug 2017",
    "description": "A simple Java text editor. Features include opening, saving, and editing system text files, changing font size, finding occurrences of a string, replacing all occurrences of a string, and setting word-wrapping.",
    "image": "http://i.imgur.com/tox9Md0.gif",
    "link": "https://github.com/SkylerRankin/SimpleTextEditor"
  },
  {
    "title": "Forum",
    "date": "May 2017",
    "description": "A generic forum built to learn the fundamentals of web applications. With Node, Express, EJS, and MongoDB, this application supports user accounts, posting, and the usual forum functionality. I hope to get it live with some hosting service soon!",
    "image": "https://i.imgur.com/NqkPSaP.gif",
    "link": "https://github.com/SkylerRankin/forum"
  },
  {
    "title": "Sudoku Solver",
    "date": "Apr 2017",
    "description": "Brute forces any sudoku puzzle with the highly effective recursive-backtracking technique. Using the animation option allows you to see the algorithm work as it checks if values are part of a valid solution or not.",
    "image": "http://i.imgur.com/9pIGxad.gif",
    "link": "https://github.com/SkylerRankin/sudokusolver"
  },
  {
    "title": "Super Mario Bros. 1-1",
    "date": "Apr 2017",
    "description": "A replication of the first level of the first Mario game. Written in Java, spritesheets created in Photoshop. It runs at a much higher fps than the original just so its more enjoyable to play.",
    "image": "http://i.imgur.com/PRBJJNm.gif",
    "link": "https://github.com/SkylerRankin/MarioLevelOne"
  },
  {
    "title": "Performance Graphing",
    "date": "Jul 2017",
    "description": "Provides a visualization to see if algorithms follow 'big o notation' as they would in theory. The tests are as follows: for constant performance, a truth check O(1); for linear performance, a linear search O(n); for quadratic performance, a duplicate value check on two arrays O(n^2); for exponential performance decay, Fibbonaci number calculation O(2^n); and finally for logarithmic performance, a binary Search on sorted list O(log(n)).",
    "image": "http://i.imgur.com/Fsn0oFk.gif",
    "link": "https://github.com/SkylerRankin/BigOGraph"
  },
  {
    "title": "Fractal Trees",
    "date": "Jun 2017",
    "description": "A generator for creating two branch fractals of n levels. With the sliders at the bottom of the interface, the starting width and length can be adjusted, as well as the angle between each branch and its connecting two branches. This is written in Java.",
    "image": "http://i.imgur.com/wyXAkWU.gif",
    "link": "https://github.com/SkylerRankin/twobranchtree"
  },
  {
    "title": "Pi Summations",
    "date": "Jun 2017",
    "description": "A web view to demonstrate various summation functions that converge at pi, providing a visualization for how long this sort of convergence actually takes.",
    "image": "http://i.imgur.com/DYYrXoj.gif",
    "link": "https://github.com/SkylerRankin/pi"
  }
]
